Revit 2027 API
PipingSystemType.FluidTemperature Property
 Fluid Temperature, in Kelvin.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FluidTemperature { get; set; }
Public Property FluidTemperature As Double
	Get
	Set
public:
property double FluidTemperature {
	double get ();
	void set (double value);
}
member FluidTemperature : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for fluidTemperature is not finite
Remarks
 Setter will choose the closest available temperature in settings.
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace